Revit 2026 API

# Marble Class

---

A static class that provides access to the property names that appear in the Marble visual asset schema.

SystemObject Autodesk.Revit.DB.VisualMarble

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class Marble
```
```vb
Public NotInheritable Class Marble
```
```cpp
public ref class Marble abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type Marble = class end
```

The Marble type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MarbleColor1 | The property labeled "Stone Color" from the "Marble" schema. |
|  | MarbleColor2 | The property labeled "Vein Color" from the "Marble" schema. |
|  | MarbleSize | The property labeled "Vein Spacing" from the "Marble" schema. |
|  | MarbleWidth | The property labeled "Vein Width" from the "Marble" schema. |
|  | TextureAngle | The property labeled "Angle" from the "Marble" schema. |
|  | TextureLinkTextureTransforms | The property labeled "Link Transforms" from the "Marble" schema. |
|  | TextureRealWorldOffsetX | The property labeled "Offset X" from the "Marble" schema. |
|  | TextureRealWorldOffsetY | The property labeled "Offset Y" from the "Marble" schema. |
|  | TextureRealWorldOffsetZ | The property labeled "Offset Z" from the "Marble" schema. |

#### Reference

Autodesk.Revit.DB.Visual Namespace